/*
Задать массив из 12 элементов,
заполнение числами из [0, 9]. Найти сумму 
положительных/ отрицательных элементов  массива

0. Разобраться\ сщздать репозиторий на гитхабе
0.1 .gitignore
1. Пока не уточнили условия - уточнить условия
2. Декомпозиция условий
3. Выявить главную задачу
4. Проработка алгоритма
5. БЛОК-СХЕМА
6. Писать код
7. Пока нет тестов -- тестировать
8. Рефакторинг   -- можно ли улучшить код
9. push'шите

Писать коминтарии
Ясные названия переменным и методам

*/

// new
// Задать массив из 12 элементов,
// заполнение числами из [0, 9]. Найти сумму 
// положительных/ отрицательных элементов  массива

// 

